<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
<script id="versionArea" type="text/javascript">
//<![CDATA[
var version = {title: "TiddlyWiki", major: 2, minor: 8, revision: 1, date: new Date("June 23, 2013"), extensions: {}};

//]]>
</script>
	
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="copyright" content="
TiddlyWiki created by Jeremy Ruston, (jeremy [at] osmosoft [dot] com)

Copyright (c) Jeremy Ruston 2004-2007
Copyright (c) UnaMesa Association 2007-2012

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

Redistributions of source code must retain the above copyright notice, this
list of conditions and the following disclaimer.

Redistributions in binary form must reproduce the above copyright notice, this
list of conditions and the following disclaimer in the documentation and/or other
materials provided with the distribution.

Neither the name of the UnaMesa Association nor the names of its contributors may be
used to endorse or promote products derived from this software without specific
prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 'AS IS' AND ANY
EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES

	cout &lt;&lt; &quot;pd2虚函数表地址：&quot; &lt;&lt; (int*)*(int*)(pd2) &lt;&lt; endl;
	cout &lt;&lt; &quot;b1虚函数表  — 第一个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(&amp;b1) + 0) &lt;&lt; endl;
	cout &lt;&lt; &quot;b2虚函数表  — 第一个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(&amp;b2) + 0) &lt;&lt; endl;
	cout &lt;&lt; &quot;d1虚函数表  — 第一个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(&amp;d1) + 0) &lt;&lt; endl;
	cout &lt;&lt; &quot;d2虚函数表  — 第一个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(&amp;d2) + 0) &lt;&lt; endl;
	cout &lt;&lt; &quot;pd1虚函数表 — 第一个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(pd1) + 0) &lt;&lt; endl;
	cout &lt;&lt; &quot;pd2虚函数表 — 第一个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(pd2) + 0) &lt;&lt; endl;
	cout &lt;&lt; &quot;b1虚函数表  — 第二个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(&amp;b1) + 1) &lt;&lt; endl;
	cout &lt;&lt; &quot;b2虚函数表  — 第二个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(&amp;b2) + 1) &lt;&lt; endl;
	cout &lt;&lt; &quot;d1虚函数表  — 第二个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(&amp;d1) + 1) &lt;&lt; endl;
	cout &lt;&lt; &quot;d2虚函数表  — 第二个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(&amp;d2) + 1) &lt;&lt; endl;
	cout &lt;&lt; &quot;pd1虚函数表 — 第二个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(pd1) + 1) &lt;&lt; endl;
	cout &lt;&lt; &quot;pd2虚函数表 — 第二个函数地址：&quot; &lt;&lt; (int*)*((int*)*(int*)(pd2) + 1) &lt;&lt; endl;

	
	typedef void (*VFUN)(void);

	cout &lt;&lt; &quot;b1 与 d1 执行第一个函数地址&quot; &lt;&lt; endl;
	VFUN pv1 = (VFUN)*((int*)*(int*)(&amp;b1));
	VFUN pv2 = (VFUN)*((int*)*(int*)(&amp;d1));
	pv1();
	pv2();
	cout &lt;&lt; &quot;b1 与 d1 执行第二个函数地址&quot; &lt;&lt; endl;
	pv1 = (VFUN)*((int*)*(int*)(&amp;b1) + 1);
	pv2 = (VFUN)*((int*)*(int*)(&amp;d1) + 1);
	pv1();
	pv2();
	cout &lt;&lt; &quot;b1 与 d1 执行第四个函数地址&quot; &lt;&lt; endl;
	pv1 = (VFUN)*((int*)*(int*)(&amp;b1) + 3);
	pv2 = (VFUN)*((int*)*(int*)(&amp;d1) + 3);
	//pv1(); error
	//pv2(); error
	typedef void (*VFUN2)(B1*);
	VFUN2 pv3 = (VFUN2)*((int*)*(int*)(&amp;b1) + 3);
	VFUN2 pv4 = (VFUN2)*((int*)*(int*)(&amp;d1) + 3);
	pv3(&amp;b1);
	pv4(&amp;d1);
	
	
	cout &lt;&lt; &quot;sizeof(int*): &quot; &lt;&lt; sizeof(int*) &lt;&lt; endl;
	cout &lt;&lt; &quot;sizeof(double): &quot; &lt;&lt; sizeof(double) &lt;&lt; endl;
	cout &lt;&lt; &quot;sizeof(float): &quot; &lt;&lt; sizeof(float) &lt;&lt; endl;
	cout &lt;&lt; &quot;sizeof(unsigned long): &quot; &lt;&lt; sizeof(unsigned long) &lt;&lt; endl;
	cout &lt;&lt; &quot;sizeof(long): &quot; &lt;&lt; sizeof(long) &lt;&lt; endl;
	cout &lt;&lt; &quot;sizeof(unsigned int): &quot; &lt;&lt; sizeof(unsigned int) &lt;&lt; endl;
	cout &lt;&lt; &quot;sizeof(int): &quot; &lt;&lt; sizeof(int) &lt;&lt; endl;
	cout &lt;&lt; &quot;sizeof(unsigned short): &quot; &lt;&lt; sizeof(unsigned short) &lt;&lt; endl;
	cout &lt;&lt; &quot;sizeof(short): &quot; &lt;&lt; sizeof(short) &lt;&lt; endl;
}

int main() {
	PrintVirutalFucAddr();
	return 0;
}
&lt;/code&gt;
使用msvc编译器开关d1reportSingleClassLayoutXXX打印对应类的结构
{{{cl /d1reportSingleClassLayoutB1 test.cpp /c}}}
对应B1的结构如下
{{{
class B1	size(16):
	+---
 0	| {vfptr}
 8	| x
  	| &lt;alignment member&gt; (size=4)
	+---

B1::$vftable@:
	| &amp;B1_meta
	|  0
 0	| &amp;B1::g1
 1	| &amp;B1::g2
 2	| &amp;B1::g3
 3	| &amp;B1::v1
 4	| &amp;B1::v2
 5	| &amp;B1::v3
}}}
对应D1的结构如下
{{{
class D1	size(24):
	+---
	| +--- (base class B1)
 0	| | {vfptr}
 8	| | x
  	| | &lt;alignment member&gt; (size=4)
	| +---
16	| x
  	| &lt;alignment member&gt; (size=4)
	+---

D1::$vftable@:
	| &amp;D1_meta
	|  0
 0	| &amp;D1::g1
 1	| &amp;B1::g2
 2	| &amp;B1::g3
 3	| &amp;D1::v1
 4	| &amp;D1::v2
 5	| &amp;D1::v3
}}}
运行结果如下：
{{{
b1对象地址：0xbf8a3460
b2对象地址：0xbf8a3468
d1对象地址：0xbf8a3470
d2对象地址：0xbf8a3478
pd1对象地址：0xbf8a3470
pd2对象地址：0xbf8a3478
b1虚函数表地址：0x804a688
b2虚函数表地址：0x804a688
d1虚函数表地址：0x804a6a8
d2虚函数表地址：0x804a6a8
pd1虚函数表地址：0x804a6a8
pd2虚函数表地址：0x804a6a8
b1虚函数表  — 第一个函数地址：0x8049e30
b2虚函数表  — 第一个函数地址：0x8049e30
d1虚函数表  — 第一个函数地址：0x8049db0
d2虚函数表  — 第一个函数地址：0x8049db0
pd1虚函数表 — 第一个函数地址：0x8049db0
pd2虚函数表 — 第一个函数地址：0x8049db0
b1虚函数表  — 第二个函数地址：0x8049d30
b2虚函数表  — 第二个函数地址：0x8049d30
d1虚函数表  — 第二个函数地址：0x8049d30
d2虚函数表  — 第二个函数地址：0x8049d30
pd1虚函数表 — 第二个函数地址：0x8049d30
pd2虚函数表 — 第二个函数地址：0x8049d30
b1 与 d1 执行第一个函数地址
B1::g1
D1::g1
b1 与 d1 执行第二个函数地址
B1::g2
B1::g2
b1 与 d1 执行第四个函数地址
B1::v1 with 1
D1::v1 with 3
